print('Завдання: ')
print('У школі облаштовують три нові класи для семикласників. Кількість учнів у кожному з класів потрібно')
print('ввести під час виконання програми. За однією партою може сидіти не більше двох учнів.')
print('')
pupils = int(input('Скільки учнів навчається у сьомому класі? - '))
tables = round(pupils/2+0.1)
tables = tables*3
print('треба закупити' , tables , 'для сьомих класів' )
print('Результат: необхідно закупити ' , tables , 'парт для облаштування 3-х классів')
input()

print("Завдання:")
print('Плановий відділ швейної компанії розраховує площу тканини, яка залишиться після того')
print('як із заготівки розміром АхА метрів вирізали круг радіусом r.')
print('')
a = float(input('Введіть довжину сторони тканини -'))
r = float(input('Введіть радіус круга вирізаної тканини - '))
skrug = 3.14*r**2
skvadrat = a*a-skrug
print('Результат: в залишку ' , round(skvadrat , 2), 'метрів квадратної тканини.')
input()

print('завдання')
print('для виготовлення жестяної коробки використовують квадратний лист жесті .')
print('висота коробки дорівнює b сантиметрів . маса 1 см2 жерсті становить с г. визначте масу коробки')
print('')
b = float(input('введіть висоту коробки'))
с = float(input('Введіть масу 1 см2 жесті'))
vaga = b*b*c*6
print('Результат : маса коробки складає ', vaga , 'грам.')
input()

print('Завдання: ')
print('В електронній касі у двох комірках містяться кошти в розмірі а грн та b грн. Складіть алгоритм,')
print('за допомогою якого кошти в цих комірках будуть обміняні значеннями за умови,')
print('що додаткової касової комірки немає.')
print('Примітка: можна використовувати операції додавання і віднімання')
print('')
a = float(input('Скільки грн в комірці А? - '))
b = a - b
a = a - b
print('у комірці А - ', a , 'грн')
print('у комірці В -' , b , 'грн')
input()

